import { useNavigation } from "@react-navigation/native";
import { View, Text, StyleSheet, TouchableOpacity, Image, ScrollView } from "react-native";
import image from './SignUpZurag/news1.png'
import cover from '../assets/dead.png'
import { FontAwesome5 } from '@expo/vector-icons';

export default function News() {
    const navigation = useNavigation();
    const Goback = () => {
        navigation.goBack()
    }
    return (
        <ScrollView contentContainerStyle={styles.scrollContainer}>
            <View style={styles.container}>
            <TouchableOpacity
                style={styles.roundButton1}
                onPress={Goback}>
                <FontAwesome5 name='chevron-left' size={20} color='#7B7576' style={styles.textBig} />
            </TouchableOpacity>
                <View>
                    <Image source={image} style={styles.img} />
                <Text styles={styles.head}>DEADLIFT БУЮУ ҮНДСЭН ТАТАЛТЫГ ЗӨВ ХИЙХ 4 АРГА ТЕХНИК</Text>
                <Text style={styles.txt}>Deadlift (дээдлифт) буюу үндсэн таталтыг бодилдингийн ганц сайн дасгал гэж үздэг бөгөөд “Масс Нэмэх Хаан Дасгал” гэж өргөмжилдөг. Яагаад гэвэл энэ дасгалыг хийхэд маш олон булчин ажилладаг. Гэхдээ зүгээр л хамаг чадлаараа хүчлээд хийчихдэг дасгал биш юм. Энэ дасгалыг яаж зөв хийх талаар таван эксперт туршлагаа хуваалцаж байгааг хүргэе.
                    Үндсэн таталт нь биеийн дээд болон доод хэсгийг хоёуланг нь хөгжүүлэх хамгийн сайн дасгал мөн үү? Энэ дасгалыг хийгээд байвал бусад төрлийн дасгал хийснээс илүү их хүч чадал, масс нэмэх үү? Эдгээр асуултууд дээр хэн ч яв цав хариулт, дүгнэлтэнд хүрээгүй л байна. Гэвч, масс нэмэх зорилготой хүмүүст үндсэн таталт нь бэлтгэлийн зайлшгүй хэсэг байх хэрэгтэй гэдэг дээр хэн ч маргадаггүй. Хамгийн гол асуулт бол: Үндсэн таталтыг хэрхэн зөв хийх вэ?
                    Энэ асуултын хариултыг олохын тулд спортын анагаах ухаан болон хүчний дасгалын таван эксперттэй ярилцлаа. Юуны өмнө, хүн болгон өөр, өөрийн онцлог хэлбэр галбир, геометр, болон хөдөлгөөний хэмнэлтэй гэдэг дээр бид санал нэгдлээ. Гэсэн хэдий ч, энд танилцуулах “4 арга техник” нь бараг л бүх хүнд адилхан хамааралтай юм.асуулт бол: Үндсэн таталтыг хэрхэн зөв хийх вэ?
                </Text>
                <Text style={styles.txt}>
                    ТЕХНИК 1: ИХ БИЕЭ ТҮГЖИЖ, ТҮНХЭЭ АЖИЛЛУУЛАХ
                    Булчин агшихад үе мөч заавал хөдөлгөөнгүй, чанга болдог. Үндсэн таталт хийхэд нурууг түгжиж, хөдөлгөөнгүй барьна – ингэснээр нурууны диск гэмтэхээс сэргийлж, хүч чадлаа илүү их дайчлах боломжтой болдог. Үсэрхэд юу болдгийг аваад үзье л дээ. Дээшээ үсэрхэд эсхүл үсрээд газар буухад шагай сул биш, хөдөлгөөнгүй, чанга байх ёстой – ингэснээр түлхэлт үүсгэнэ. Өндөр үсрэх тусам шагай илүү хөдөлгөөнгүй, илүү чанга байх ёстой.
                    Яг энэ зарчим үндсэн таталт дээр үйлчилдэг. Үндсэн таталтыг супер зөв хийхийн тулд их бие болон нуруугаа түгжиж, хөдөлгөөнгүй, чанга барих хэрэгтэй. Нуруугаа түгжсэнээр ачааллыг түнх рүү шилжүүлж, цаашлаад гуя руу ихэнх ачааллыг өгч, хөлний булчинг илүү ажиллуулдаг. Их биеэ түгжиж, хөдөлгөөнгүй болгосноор мэдрэлийн булчинг илүү хүчтэй ажиллуулах сигналыг тархинд өгч, гэмтэлээс сэргийлэхийн зэрэгцээ илүү хүнд жин өргөх чадвартай болгодог.
                </Text>

                <Image source={cover} style={styles.img}/>
                <Text style={styles.txt}>
                    ТЕХНИК 2: ХАГАС ҮНДСЭН ТАТАЛТ ХИЙХ
                    Үндсэн таталт нь бүтэн ба хагас гэсэн төрөлтэй байдаг. Бүтэн үндсэн таталт гэдэг нь штангийг газраас татахыг хэлдэг бол хагас үндсэн таталт гэдэг нь штангийг газраас биш харин блок буюу хайрцаг эсхүл штангны тавиур дээрээс татахыг хэлдэг.
                </Text>

                <Text style={styles.txt}>
                    ТЕХНИК 3: ӨӨРТӨӨ ХАМГИЙН ТОХИРОМЖТОЙ ХӨЛНИЙ БАЙРЛАЛАА ОЛОХ
                    Мэдээж хүн бүрийн биеийн анатоми өөр. Түнхний хүчээ дайчлан гаргахад ямар хөлийн байрлал танд хамгийн тохиромжтой болохыг таны бие анатоми л хэлнэ. Хэрэв өөртөө хамгийн тохиромжтой хөлийн байрлалаа авахгүй бол хамаг хүч, ачааллаа нурууны доод хэсэгтээ өгч, нурууны дискээ гэмтээх, нуруу нугасны доод хэсгээс салбарлан түнх, өгзөг, хөл рүү очиж байгаа мэдрэлийн дагуу өвдөлт өгөх өндөр эрсдэлтэй.</Text>
                <Text style={styles.txt}>
                    ТЕХНИК 4: АНХААРЛАА ТӨВЛӨРҮҮЛЭХ
                    Дэлхий дээрх хамгийн шилдэг арга, зөвлөмж, нууцыг олж мэдсэн ч гэсэн таны сэтгэлгээ, хандлага болон арга барил л хамгийн чухал.
                    Ихэнх хүмүүс хамт дасгал хийдэг партнертай байдаг. Ихэнх хүмүүс дасгал хийж байхдаа чалчих дуртай. Гэхдээ юм болгонд хэзээ, хаана гэдэг чухал тохироо бий.
                </Text>
                </View>

            </View>
        </ScrollView>
    )
}

const styles = StyleSheet.create({
    scrollContainer: {
        flexGrow: 1,
        paddingBottom: 10,
    },
    head: {
        alignItems: 'center',
        position: 'absolute',
        position: 'absolute',
        left: 44,
        top: 60
    },
    img: {
        paddingTop: 10,
        marginBottom: 20,
        marginLeft: 20
    },
    txt: {
        marginTop: 5,
        marginBottom: 5
    },
    roundButton1: {
        position: "absolute",
        width: 50,
        height: 50,
        left: 20,
        top: 50,
        borderColor: '#CFCFCF',
        borderRadius: 30,
        backgroundColor: "#FFFF",
        borderWidth:1
      },
      textBig: {
        alignSelf: 'center',
        position: 'absolute',
        paddingTop: 15,
      },
    container: {
        flex: 1,
        justifyContent: 'center',
        alignItems: 'center',
        padding: 20,
        paddingTop: 100,

    },
})